import React from 'react';

function Categories() {
    return (
        <section className="px-8">
            <div className="w-full flex flex-wrap border-black border-t pt-4 pb-4">
                <div className="w-1/2 sm:max-md:w-full pr-4 lg:w-1/2 aspect-square">
                    <div className="relative flex h-full border border-black group/item p-8 group/item items-center justify-center">
                        <h4 className="font-gilbold uppercase text-5xl text-center">Образовательный центр</h4>
                        <div className="group/details flex justify-between flex-col invisible hover:bg-theme-blue group-hover/item:visible w-full h-full top-0 left-0 absolute p-8 transition ease-in duration-75">
                            <div className="text-white space-y-5">
                                <p>Повседневная практика показывает, что дальнейшее развитие различных форм деятельности
                                    представляет собой интересный эксперимент проверки модели развития. Равным образом
                                    укрепление и развитие структуры представляет собой интересный эксперимент проверки
                                    дальнейших направлений развития.</p>

                                <p>Не следует, однако забывать, что реализация намеченных плановых заданий позволяет выполнять
                                    важные задания по разработке соответствующий условий активизации. Равным образом дальнейшее
                                    развитие различных форм деятельности требуют от нас анализа дальнейших направлений
                                    развития.</p>

                                <p>Задача организации, в особенности же дальнейшее развитие различных форм деятельности играет
                                    важную роль в формировании дальнейших направлений развития. Товарищи! реализация намеченных
                                    плановых заданий обеспечивает широкому кругу (специалистов) участие в формировании
                                    дальнейших направлений развития. Товарищи! укрепление и развитие структуры требуют от нас
                                    анализа форм развития. Равным образом сложившаяся структура организации способствует
                                    подготовки и реализации существенных финансовых и административных условий. Идейные
                                    соображения высшего порядка, а также начало повседневной работы по формированию позиции
                                    позволяет выполнять важные задания по разработке форм развития.</p>

                                <p>Равным образом сложившаяся структура организации представляет собой интересный эксперимент
                                    проверки существенных финансовых и административных условий. Равным образом консультация с
                                    широким активом способствует подготовки и реализации форм развития. С другой стороны начало
                                    повседневной работы по формированию позиции представляет собой интересный эксперимент
                                    проверки модели развития. С другой стороны консультация с широким активом требуют
                                    определения и уточнения систем массового участия.</p>
                            </div>
                            <div className="link text-xl text-white font-gilbold uppercase">
                                <a href="" title="" className="flex flex-row items-center space-x-3"><span>→</span> <span>Подробная информация</span></a>
                            </div>
                        </div>
                    </div>
                </div>
                <div className=" w-1/2 sm:max-md:w-full pl-4 border-l border-black lg:w-1/2 aspect-square">
                    <div className="relative h-full border border-black group/item">
                        <div className="flex flex-col justify-between h-[calc((100%/2)-0.8rem)] p-8">
                            <div>
                                <h4 className="font-gilbold uppercase text-2xl mb-2">Интенсивные курсы русского языка</h4>
                            </div>
                            <div>
                                <p className="font-gilregular">Отличный способ погрузиться в языковую среду в течении регулярных двухнедельных занятий</p>
                            </div>
                        </div>
                        <div className="h-[calc((100%/2)+0.8rem)] bg-blue-900">
                            <img
                                src="/images/test/urok.png"
                                alt="My Image"
                                className="object-fill h-full w-full"
                            />
                        </div>
                        <div className="group/details flex justify-between flex-col invisible hover:bg-theme-blue group-hover/item:visible w-full h-full top-0 left-0 absolute p-8 transition ease-in duration-75">
                            <div className="text-white space-y-5">
                                <p>Повседневная практика показывает, что дальнейшее развитие различных форм деятельности
                                    представляет собой интересный эксперимент проверки модели развития. Равным образом
                                    укрепление и развитие структуры представляет собой интересный эксперимент проверки
                                    дальнейших направлений развития.</p>

                                <p>Не следует, однако забывать, что реализация намеченных плановых заданий позволяет выполнять
                                    важные задания по разработке соответствующий условий активизации. Равным образом дальнейшее
                                    развитие различных форм деятельности требуют от нас анализа дальнейших направлений
                                    развития.</p>

                                <p>Задача организации, в особенности же дальнейшее развитие различных форм деятельности играет
                                    важную роль в формировании дальнейших направлений развития. Товарищи! реализация намеченных
                                    плановых заданий обеспечивает широкому кругу (специалистов) участие в формировании
                                    дальнейших направлений развития. Товарищи! укрепление и развитие структуры требуют от нас
                                    анализа форм развития. Равным образом сложившаяся структура организации способствует
                                    подготовки и реализации существенных финансовых и административных условий. Идейные
                                    соображения высшего порядка, а также начало повседневной работы по формированию позиции
                                    позволяет выполнять важные задания по разработке форм развития.</p>

                                <p>Равным образом сложившаяся структура организации представляет собой интересный эксперимент
                                    проверки существенных финансовых и административных условий. Равным образом консультация с
                                    широким активом способствует подготовки и реализации форм развития. С другой стороны начало
                                    повседневной работы по формированию позиции представляет собой интересный эксперимент
                                    проверки модели развития. С другой стороны консультация с широким активом требуют
                                    определения и уточнения систем массового участия.</p>
                            </div>
                            <div className="link text-xl text-white font-gilbold uppercase">
                                <a href="" title="" className="flex flex-row items-center space-x-3"><span>→</span> <span>Подробная информация</span></a>
                            </div>
                        </div>
                    </div>
                </div>
            </div>
            <div className="w-full flex flex-wrap border-black border-t pt-4 pb-4">
                <div className="w-1/2 sm:max-md:w-full pr-4 lg:w-1/2 aspect-square">
                    <div className="relative flex h-full border border-black group/item p-8 group/item items-center justify-center">
                        <h4 className="font-gilbold uppercase text-5xl text-center">Художественная мастерская</h4>
                        <div className="group/details flex justify-between flex-col invisible hover:bg-theme-yellow group-hover/item:visible w-full h-full top-0 left-0 absolute p-8 transition ease-in duration-75">
                            <div className="text-white space-y-5">
                                <p>Повседневная практика показывает, что дальнейшее развитие различных форм деятельности
                                    представляет собой интересный эксперимент проверки модели развития. Равным образом
                                    укрепление и развитие структуры представляет собой интересный эксперимент проверки
                                    дальнейших направлений развития.</p>

                                <p>Не следует, однако забывать, что реализация намеченных плановых заданий позволяет выполнять
                                    важные задания по разработке соответствующий условий активизации. Равным образом дальнейшее
                                    развитие различных форм деятельности требуют от нас анализа дальнейших направлений
                                    развития.</p>

                                <p>Задача организации, в особенности же дальнейшее развитие различных форм деятельности играет
                                    важную роль в формировании дальнейших направлений развития. Товарищи! реализация намеченных
                                    плановых заданий обеспечивает широкому кругу (специалистов) участие в формировании
                                    дальнейших направлений развития. Товарищи! укрепление и развитие структуры требуют от нас
                                    анализа форм развития. Равным образом сложившаяся структура организации способствует
                                    подготовки и реализации существенных финансовых и административных условий. Идейные
                                    соображения высшего порядка, а также начало повседневной работы по формированию позиции
                                    позволяет выполнять важные задания по разработке форм развития.</p>

                                <p>Равным образом сложившаяся структура организации представляет собой интересный эксперимент
                                    проверки существенных финансовых и административных условий. Равным образом консультация с
                                    широким активом способствует подготовки и реализации форм развития. С другой стороны начало
                                    повседневной работы по формированию позиции представляет собой интересный эксперимент
                                    проверки модели развития. С другой стороны консультация с широким активом требуют
                                    определения и уточнения систем массового участия.</p>
                            </div>
                            <div className="link text-xl text-white font-gilbold uppercase">
                                <a href="" title="" className="flex flex-row items-center space-x-3"><span>→</span> <span>Подробная информация</span></a>
                            </div>
                        </div>
                    </div>
                </div>
                <div className=" w-1/2 sm:w-full md:w-full pl-4 border-l border-black lg:w-1/2 aspect-square">
                    <div className="relative h-full border border-black group/item">
                        <div className="flex flex-col justify-between h-[calc((100%/2)-0.8rem)] p-8">
                            <div>
                                <h4 className="font-gilbold uppercase text-2xl mb-2">Класс керамики</h4>
                            </div>
                            <div>
                                <p className="font-gilregular">Опытные мастера-керамисты научат всех желающих гончарному ремеслу, ручной лепке, техникам росписи керамических изделий.</p>
                            </div>
                        </div>
                        <div className="h-[calc((100%/2)+0.8rem)] bg-blue-900">
                            <img
                                src="/images/test/keramika.png"
                                alt="My Image"
                                className="object-fill h-full w-full"
                            />
                        </div>
                        <div className="group/details flex justify-between flex-col invisible hover:bg-theme-yellow group-hover/item:visible w-full h-full top-0 left-0 absolute p-8 transition ease-in duration-75">
                            <div className="text-white space-y-5">
                                <p>Повседневная практика показывает, что дальнейшее развитие различных форм деятельности
                                    представляет собой интересный эксперимент проверки модели развития. Равным образом
                                    укрепление и развитие структуры представляет собой интересный эксперимент проверки
                                    дальнейших направлений развития.</p>

                                <p>Не следует, однако забывать, что реализация намеченных плановых заданий позволяет выполнять
                                    важные задания по разработке соответствующий условий активизации. Равным образом дальнейшее
                                    развитие различных форм деятельности требуют от нас анализа дальнейших направлений
                                    развития.</p>

                                <p>Задача организации, в особенности же дальнейшее развитие различных форм деятельности играет
                                    важную роль в формировании дальнейших направлений развития. Товарищи! реализация намеченных
                                    плановых заданий обеспечивает широкому кругу (специалистов) участие в формировании
                                    дальнейших направлений развития. Товарищи! укрепление и развитие структуры требуют от нас
                                    анализа форм развития. Равным образом сложившаяся структура организации способствует
                                    подготовки и реализации существенных финансовых и административных условий. Идейные
                                    соображения высшего порядка, а также начало повседневной работы по формированию позиции
                                    позволяет выполнять важные задания по разработке форм развития.</p>

                                <p>Равным образом сложившаяся структура организации представляет собой интересный эксперимент
                                    проверки существенных финансовых и административных условий. Равным образом консультация с
                                    широким активом способствует подготовки и реализации форм развития. С другой стороны начало
                                    повседневной работы по формированию позиции представляет собой интересный эксперимент
                                    проверки модели развития. С другой стороны консультация с широким активом требуют
                                    определения и уточнения систем массового участия.</p>
                            </div>
                            <div className="link text-xl text-white font-gilbold uppercase">
                                <a href="" title="" className="flex flex-row items-center space-x-3"><span>→</span> <span>Подробная информация</span></a>
                            </div>
                        </div>
                    </div>
                </div>
            </div>
            <div className="w-full flex flex-wrap border-black border-t pt-4">
                <div className="w-1/2 sm:w-full md:w-full pr-4 lg:w-1/2 aspect-square">
                    <div className="relative flex h-full border border-black group/item p-8 group/item items-center justify-center ">
                        <h4 className="font-gilbold uppercase text-5xl text-center">Студии и клубы</h4>
                        <div className="group/details flex justify-between flex-col invisible hover:bg-theme-green group-hover/item:visible w-full h-full top-0 left-0 absolute p-8 transition ease-in duration-75">
                            <div className="text-white space-y-5">
                                <p>Повседневная практика показывает, что дальнейшее развитие различных форм деятельности
                                    представляет собой интересный эксперимент проверки модели развития. Равным образом
                                    укрепление и развитие структуры представляет собой интересный эксперимент проверки
                                    дальнейших направлений развития.</p>

                                <p>Не следует, однако забывать, что реализация намеченных плановых заданий позволяет выполнять
                                    важные задания по разработке соответствующий условий активизации. Равным образом дальнейшее
                                    развитие различных форм деятельности требуют от нас анализа дальнейших направлений
                                    развития.</p>

                                <p>Задача организации, в особенности же дальнейшее развитие различных форм деятельности играет
                                    важную роль в формировании дальнейших направлений развития. Товарищи! реализация намеченных
                                    плановых заданий обеспечивает широкому кругу (специалистов) участие в формировании
                                    дальнейших направлений развития. Товарищи! укрепление и развитие структуры требуют от нас
                                    анализа форм развития. Равным образом сложившаяся структура организации способствует
                                    подготовки и реализации существенных финансовых и административных условий. Идейные
                                    соображения высшего порядка, а также начало повседневной работы по формированию позиции
                                    позволяет выполнять важные задания по разработке форм развития.</p>

                                <p>Равным образом сложившаяся структура организации представляет собой интересный эксперимент
                                    проверки существенных финансовых и административных условий. Равным образом консультация с
                                    широким активом способствует подготовки и реализации форм развития. С другой стороны начало
                                    повседневной работы по формированию позиции представляет собой интересный эксперимент
                                    проверки модели развития. С другой стороны консультация с широким активом требуют
                                    определения и уточнения систем массового участия.</p>
                            </div>
                            <div className="link text-xl text-white font-gilbold uppercase">
                                <a href="" title="" className="flex flex-row items-center space-x-3"><span>→</span> <span>Подробная информация</span></a>
                            </div>
                        </div>
                    </div>
                </div>
                <div className="w-1/2 sm:w-full md:w-full pl-4 border-l border-black lg:w-1/2 aspect-square">
                    <div className="relative flex h-full border border-black group/item p-8 group/item items-center justify-center">
                        <h4 className="font-gilbold uppercase text-5xl text-center">О нас</h4>
                        <div className="group/details flex justify-between flex-col invisible hover:bg-theme-blue group-hover/item:visible w-full h-full top-0 left-0 absolute p-8 transition ease-in duration-75">
                            <div className="text-white space-y-5">
                                <p>Повседневная практика показывает, что дальнейшее развитие различных форм деятельности
                                    представляет собой интересный эксперимент проверки модели развития. Равным образом
                                    укрепление и развитие структуры представляет собой интересный эксперимент проверки
                                    дальнейших направлений развития.</p>

                                <p>Не следует, однако забывать, что реализация намеченных плановых заданий позволяет выполнять
                                    важные задания по разработке соответствующий условий активизации. Равным образом дальнейшее
                                    развитие различных форм деятельности требуют от нас анализа дальнейших направлений
                                    развития.</p>

                                <p>Задача организации, в особенности же дальнейшее развитие различных форм деятельности играет
                                    важную роль в формировании дальнейших направлений развития. Товарищи! реализация намеченных
                                    плановых заданий обеспечивает широкому кругу (специалистов) участие в формировании
                                    дальнейших направлений развития. Товарищи! укрепление и развитие структуры требуют от нас
                                    анализа форм развития. Равным образом сложившаяся структура организации способствует
                                    подготовки и реализации существенных финансовых и административных условий. Идейные
                                    соображения высшего порядка, а также начало повседневной работы по формированию позиции
                                    позволяет выполнять важные задания по разработке форм развития.</p>

                                <p>Равным образом сложившаяся структура организации представляет собой интересный эксперимент
                                    проверки существенных финансовых и административных условий. Равным образом консультация с
                                    широким активом способствует подготовки и реализации форм развития. С другой стороны начало
                                    повседневной работы по формированию позиции представляет собой интересный эксперимент
                                    проверки модели развития. С другой стороны консультация с широким активом требуют
                                    определения и уточнения систем массового участия.</p>
                            </div>
                            <div className="link text-xl text-white font-gilbold uppercase">
                                <a href="" title="" className="flex flex-row items-center space-x-3"><span>→</span> <span>Подробная информация</span></a>
                            </div>
                        </div>
                    </div>
                </div>
            </div>
        </section>
    );
}

export default Categories;